In [27]:
import pandas as  pd
link='https://raw.githubusercontent.com/Anasuya-Sahoo/DMDW-Lab/main/Toyota.csv'
df=pd.read_csv(link)

In [28]:
df.dtypes

Unnamed: 0      int64
Price           int64
Age           float64
KM             object
FuelType       object
HP             object
MetColor      float64
Automatic       int64
CC              int64
Doors          object
Weight          int64
dtype: object

In [29]:
type(df)

pandas.core.frame.DataFrame

In [30]:
df.shape

(1436, 11)

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1436 entries, 0 to 1435
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1436 non-null   int64
 1   Price       1436 non-null   int64
 2   Age         1336 non-null   float64
 3   KM          1436 non-null   object
 4   FuelType    1336 non-null   object
 5   HP          1436 non-null   object
 6   MetColor    1286 non-null   float64
 7   Automatic   1436 non-null   int64
 8   CC          1436 non-null   int64
 9   Doors       1436 non-null   object
 10  Weight      1436 non-null   int64
dtypes: float64(2), int64(5), object(4)
memory usage: 123.5+ KB

In [32]:
df.head()

   Unnamed: 0  Price   Age     KM  ... Automatic    CC  Doors  Weight
0           0  13500  23.0  46986  ...         0  2000  three    1165
1           1  13750  23.0  72937  ...         0  2000      3    1165
2           2  13950  24.0  41711  ...         0  2000      3    1165
3           3  14950  26.0  48000  ...         0  2000      3    1165
4           4  13750  30.0  38500  ...         0  2000      3    1170

[5 rows x 11 columns]

In [33]:
df[['Price','Age']][0:10]

   Price   Age
0  13500  23.0
1  13750  23.0
2  13950  24.0
3  14950  26.0
4  13750  30.0
5  12950  32.0
6  16900  27.0
7  18600  30.0
8  21500  27.0
9  12950  23.0

In [34]:
df[['Price','Age']].head(10)

   Price   Age
0  13500  23.0
1  13750  23.0
2  13950  24.0
3  14950  26.0
4  13750  30.0
5  12950  32.0
6  16900  27.0
7  18600  30.0
8  21500  27.0
9  12950  23.0

##Working with Null Values

In [35]:
df.isnull().sum()

Unnamed: 0      0
Price           0
Age           100
KM              0
FuelType      100
HP              0
MetColor      150
Automatic       0
CC              0
Doors           0
Weight          0
dtype: int64

In [36]:
df.isnull().values.any()

True

In [37]:
df.notnull().sum()

Unnamed: 0    1436
Price         1436
Age           1336
KM            1436
FuelType      1336
HP            1436
MetColor      1286
Automatic     1436
CC            1436
Doors         1436
Weight        1436
dtype: int64

## Removing the null values

In [38]:
df1=df.dropna(inplace=False)

In [39]:
df1.isnull().sum()

Unnamed: 0    0
Price         0
Age           0
KM            0
FuelType      0
HP            0
MetColor      0
Automatic     0
CC            0
Doors         0
Weight        0
dtype: int64

## Replace the  Null values with Mean

In [43]:
df.isnull().sum()

Unnamed: 0      0
Price           0
Age           100
KM              0
FuelType      100
HP              0
MetColor      150
Automatic       0
CC              0
Doors           0
Weight          0
dtype: int64

In [47]:
import numpy as np
df['Age'].fillna(np.mean(df['Age']),inplace =True)

In [45]:
import numpy as np
df['MetColor'].fillna(np.mean(df['MetColor']),inplace =True)